export default {
  pages: {
    courses: 'Мои курсы',
    lessons: 'Мои уроки',
    home: 'Домашняя страница',
    learn: 'Урок {{ name }}',
    course: 'Курс {{ name }}',
  },
  enroll_modal: {
    review: {
      header: 'Отзывы',
      empty: 'Отзывов еще нет',
      be_first: 'Будьте первым кто добавит оценку',
    },
    start: 'Начать',
  },
  home: {
    open_lessons: {
      title: 'Открытые уроки',
      not_found: 'Нет открытых уроков',
      search: 'Название урока',
      enroll_button: 'Записаться',
      start_button: 'Начать',
    },
    open_courses: {
      title: 'Открытые курсы',
      not_found: 'Нет открытых курсов',
      search: 'Название',
      enroll_button: 'Записаться',
      start_button: 'Начать',
    },
    ongoing_lessons: {
      title: 'Текущие уроки',
      not_found: 'Нет текущих уроков',
      view_all_lessons: 'Посмотреть все мои уроки',
      view_all_courses: 'Посмотреть все мои курсы',
      continue_button: 'Продолжить',
      view_button: 'Посмотреть',
    },
    ongoing_courses: {
      title: 'Текущие курсы',
      not_found: 'Нет текущих курсов',
    },
    finished_lessons: {
      not_found: 'Нет законченых уроков',
      title: 'Законченные уроки',
    },
    finished_courses: {
      title: 'Законченные курсы',
      not_found: 'Нет законченых курсов',
    },
  },
  course: {
    by: 'От',
    lessons: 'урока(-ов)',
  },
  lesson: {
    attach: {
      download: 'Скачать прикреплённый файл',
    },
    results: {
      title: 'Результаты',
      correct_answers: 'Правильные ответы в уроке',
      total_answers: 'Общее количество вопросов в уроке',
      graded_pending: 'Вопросы с оценкой, ожидающие рассмотрения',
      percentage: '{{percentage}}% правильных ответов',
    },
    answer_result: {
      correct: 'Правильно !',
      wrong: 'Неправильно. Правильный ответ:',
      partially_wrong: 'Частично правильно. Правильный ответ:',
    },
    errors: {
      not_found: 'Урок не найден',
    },
    input_answer: 'Введите ответ...',
    input_fill_gap: {
      placeholder: 'пример',
    },
    by: 'От',
    blocks: 'уровней',
    start: 'Начать',
    next: 'Дальше',
    send: 'Отправить',
    finish: 'Закончить',
    finished: 'Урок закончен',
    back: 'Назад',
  },
  learn_footer: {
    text_before_link: 'Нравится то, что вы видите?',
    create_link: 'Попробуйте создать свой собственный урок',
    text_after_link: 'Бесплатно и без регистрации 🐸',
  },
};
